Catalogs/НомераГТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>НомераГТД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопускаетсяЗаписьСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТаможенногоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРазделаИлиТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/ЗапасыВРазрезеГТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ЗапасыВРазрезеГТД</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/НомераГТД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЗагрузкаДанныхИзВнешнегоИсточника

// Поля загрузки данных из внешнего источника.
// 
// Параметры:
//  ТаблицаПолейЗагрузки - см. ЗагрузкаДанныхИзВнешнегоИсточника.СоздатьТаблицуПолейОписанияЗагрузки
//  НастройкиЗагрузкиДанных - см. ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере
//
Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт

	ОписанияТиповПолей = ЗагрузкаДанныхИзВнешнегоИсточника.НовыйОписанияТиповПолейЗагрузки();

	Если НастройкиЗагрузкиДанных.ФиксированныйШаблон Тогда
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УИД", НСтр("ru = 'УИД'"),
			ОписанияТиповПолей.ОписаниеТиповСтрока40, ОписанияТиповПолей.ОписаниеТиповСтрока40);
	КонецЕсли;

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Код", НСтр(
		"ru = 'Номер ГТД'"), ОписанияТиповПолей.ОписаниеТиповСтрока30, ОписанияТиповПолей.ОписаниеТиповСтрока30);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "РегистрационныйНомер", НСтр(
		"ru = 'Регистрационный номер'"), ОписанияТиповПолей.ОписаниеТиповСтрока30,
		ОписанияТиповПолей.ОписаниеТиповСтрока30);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Описание", НСтр(
		"ru = 'Описание'"), ОписанияТиповПолей.ОписаниеТиповСтрока0000, ОписанияТиповПолей.ОписаниеТиповСтрока0000);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ДатаПринятия", НСтр(
		"ru = 'Дата принятия'"), ОписанияТиповПолей.ОписаниеТиповСтрока25, ОписанияТиповПолей.ОписаниеТиповДата);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ДопускаетсяЗаписьСОшибкой",
		НСтр("ru = 'Допускается запись с ошибкой'"), ОписанияТиповПолей.ОписаниеТиповСтрока11,
		ОписанияТиповПолей.ОписаниеТиповБулево);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КодТаможенногоОргана", НСтр(
		"ru = 'Код таможенного органа'"), ОписанияТиповПолей.ОписаниеТиповСтрока8,
		ОписанияТиповПолей.ОписаниеТиповСтрока8);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НомерРазделаИлиТовара", НСтр(
		"ru = 'НомерРазделаИлиТовара'"), ОписанияТиповПолей.ОписаниеТиповСтрока3,
		ОписанияТиповПолей.ОписаниеТиповСтрока3);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ПорядковыйНомер", НСтр(
		"ru = 'Порядковый номер'"), ОписанияТиповПолей.ОписаниеТиповСтрока7, ОписанияТиповПолей.ОписаниеТиповСтрока7);

КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата = Неопределено) Экспорт
	
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
		
			
		СтрокаТаблицы.НомерГТД = ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ЗаполнитьПоУИД(СтрокаТаблицы, "НомераГТД", "УИД_ВходящиеДанные");
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД) Тогда
			
			// НомерГТД по Наименованию
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНомерГТД(СтрокаТаблицы.НомерГТД, СтрокаТаблицы.Код_ВходящиеДанные);
			
		КонецЕсли; 
		
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицы.ДатаПринятия, СтрокаТаблицы.ДатаПринятия_ВходящиеДанные);
		
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицы.ДопускаетсяЗаписьСОшибкой, СтрокаТаблицы.ДопускаетсяЗаписьСОшибкой_ВходящиеДанные);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицы);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	СтрокаТаблицы._СтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД);
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	СтрокаТаблицы[ИмяСлужебногоПоля] = СтрокаТаблицы._СтрокаСопоставлена
		ИЛИ (НЕ СтрокаТаблицы._СтрокаСопоставлена И НЕ ПустаяСтрока(СтрокаТаблицы.Код_ВходящиеДанные));
	
КонецПроцедуры

Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки) Экспорт
	
	НастройкиЗагрузкиДанных = РезультатЗагрузки.НастройкиЗагрузкиДанных;
	НастройкиОбновленияСвойств = НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
	
	Для каждого СтрокаТаблицы Из РезультатЗагрузки.ТаблицаСопоставленияДанных Цикл
		
		ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
		
		СогласованноеСостояниеСтроки = (СтрокаТаблицы._СтрокаСопоставлена И РезультатЗагрузки.НастройкиЗагрузкиДанных.ОбновлятьСуществующие)
			ИЛИ (НЕ СтрокаТаблицы._СтрокаСопоставлена И РезультатЗагрузки.НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено);
		
		Если ЗагрузкаВПриложениеВозможна И СогласованноеСостояниеСтроки Тогда
			
			Если СтрокаТаблицы._СтрокаСопоставлена Тогда
				
				ЭлементСправочника = СтрокаТаблицы.НомерГТД.ПолучитьОбъект();
				ЭлементСправочника.Заблокировать();
			Иначе
				
				ЭлементСправочника = Справочники.НомераГТД.СоздатьЭлемент();
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "УИД") И ЗначениеЗаполнено(СтрокаТаблицы.УИД) Тогда
					НовыйУИД = Новый УникальныйИдентификатор(СтрокаТаблицы.УИД);
					ЭлементСправочника.УстановитьСсылкуНового(Справочники.НомераГТД.ПолучитьСсылку(НовыйУИД));
				КонецЕсли;
				
				ЭлементСправочника.ДопускаетсяЗаписьСОшибкой = Истина;
				
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы, НастройкиОбновленияСвойств.ИменаПолейОбновляемые);
			
			ЭлементСправочника.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Функция ПроверитьКорректностьЗаполненияНомераГТД(СсылкаИлиСтруктура) Экспорт
	Перем Ошибки;
	
	Если СтрДлина(СсылкаИлиСтруктура.КодТаможенногоОргана) <> 2
		И СтрДлина(СсылкаИлиСтруктура.КодТаможенногоОргана) <> 5
		И СтрДлина(СсылкаИлиСтруктура.КодТаможенногоОргана) <> 8 Тогда
		
		ТекстОшибки = НСтр("ru ='Код таможенного органа (первая секция номера) имеет ошибочную длину (допускается 2, 5, 8 символов)'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Код", ТекстОшибки, "");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СсылкаИлиСтруктура.ДатаПринятия) Тогда
		
		ТекстОшибки = НСтр("ru ='Пустая дата принятия декларации (вторая секция номера)'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Код", ТекстОшибки, "");
		
	КонецЕсли;
	
	Если СтрДлина(СсылкаИлиСтруктура.ПорядковыйНомер) <> 7 Тогда
		
		ТекстОшибки = НСтр("ru ='Порядковый номер (третья секция номера) имеет ошибочную длину (допускается только 7 символов)'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Код", ТекстОшибки, "");
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СсылкаИлиСтруктура.НомерРазделаИлиТовара)
		И СтрДлина(СсылкаИлиСтруктура.НомерРазделаИлиТовара) > 3 Тогда
		
		ТекстОшибки = НСтр("ru ='Номер раздела/товара (четвертая секция номера) имеет ошибочную длину (допускается только от 1 до 3 символов)'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Код", ТекстОшибки, "");
		
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

Функция ДанныеНомераГТД(КодСтрокой, РазделительДекларации = "/") Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("КодТаможенногоОргана",	"");
	СтруктураДанных.Вставить("ДатаПринятия",			Дата(1, 1, 1));
	СтруктураДанных.Вставить("ПорядковыйНомер",			"");
	СтруктураДанных.Вставить("НомерРазделаИлиТовара",	"");
	СтруктураДанных.Вставить("РегистрационныйНомер",	"");
	
	МассивСекцийГТД = СтрРазделить(КодСтрокой, РазделительДекларации);
	Если МассивСекцийГТД.Количество() < 3
		ИЛИ МассивСекцийГТД.Количество() > 4 Тогда
		
		СтруктураДанных.Вставить("РегистрационныйНомер", КодСтрокой);
		
	Иначе
		
		СтруктураДанных.КодТаможенногоОргана= СокрЛП(МассивСекцийГТД[0]);
		ДатаПринятияСтрокой					= СокрЛП(МассивСекцийГТД[1]);
		СтруктураДанных.ПорядковыйНомер		= СокрЛП(МассивСекцийГТД[2]);
		
		Если СтрДлина(ДатаПринятияСтрокой) = 6
			И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ДатаПринятияСтрокой) Тогда
			
			СтруктураДанных.ДатаПринятия = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаПринятияСтрокой);
			
		КонецЕсли;
		
		СтруктураДанных.РегистрационныйНомер = РегистрационныйНомер(СтруктураДанных.КодТаможенногоОргана + РазделительДекларации + ДатаПринятияСтрокой + РазделительДекларации + СтруктураДанных.ПорядковыйНомер);
		
		Если МассивСекцийГТД.Количество() = 4 Тогда
			
			СтруктураДанных.НомерРазделаИлиТовара = СокрЛП(МассивСекцийГТД[3]);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

// Возвращает регистрационный номер таможенной декларции по переданному полному номеру
// декларации на товары.
// Регистрационный номер не будет определен если "полный" номер таможенной декларации не соответствует 
// структуре номера декларации, выдаваемой российскими таможенными органами.
// 
// Регистрационный номер таможенной декларации может быть получен из "полного" номера таможенной декларации
// или регистрационного номера при условиях:
// 1. Длина номера таможенной декларации от 23 до 28 символов.
// 2. Количество элементов, разделенных знаком дробь ("/") 3 или 4.
// 3. Длина первого элемента 8 символов, второго 6, третьего 7 или 8 (в этом случае первые два символа "ОБ" или "ЗВ"), 
//    четвертого (при наличии) от 1 до 3 символов.
// 4. Второй элемент можно преобразовать в дату.
// Регистрационный номер таможенной декларации будет получен из "полного" номера таможенной декларации
// путем отсечения последнего (4-го) элемента номера.
//
// Параметры
//    НомерТаможеннойДекларации - номер таможенной декларации или регистрационный номер таможенной декларации.
//
// Возвращаемое значение:
//    Регистрационный номер - Строка - регистрационный номер таможенной декларации либо пустая строка, 
//                                     если его не удалось определить.
Функция РегистрационныйНомер(НомерТаможеннойДекларации) Экспорт
	
	НомерДекларацииНаТовары = СокрЛП(НомерТаможеннойДекларации);
	ПустойРегистрационныйНомер = "";
	
	Если СтрДлина(НомерДекларацииНаТовары) < 23
	 ИЛИ СтрДлина(НомерДекларацииНаТовары) > 28 Тогда
		Возврат ПустойРегистрационныйНомер;
	КонецЕсли;
	
	МассивТД = СтрРазделить(НомерДекларацииНаТовары, "/");
	
	Если МассивТД.Количество() > 4
	 ИЛИ МассивТД.Количество() < 3 Тогда
		// Номер декларации на товары указан с ошибками.
		Возврат ПустойРегистрационныйНомер;
	КонецЕсли;
	
	КодТаможенногоОргана = МассивТД[0];
	
	Если СтрДлина(КодТаможенногоОргана) <> 8 Тогда
		Возврат ПустойРегистрационныйНомер;
	КонецЕсли;
	
	ДатаПринятияДекларацииНаТовары = МассивТД[1];
	
	Если СтрДлина(ДатаПринятияДекларацииНаТовары) <> 6 Тогда
		Возврат ПустойРегистрационныйНомер;
	Иначе
		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ДатаПринятияДекларацииНаТовары) Тогда
			Возврат ПустойРегистрационныйНомер;
		КонецЕсли;
		СтрокаВДату = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаПринятияДекларацииНаТовары);
		Если НЕ ЗначениеЗаполнено(СтрокаВДату) Тогда
			Возврат ПустойРегистрационныйНомер;
		КонецЕсли;
	КонецЕсли;

	ПорядковыйНомерДекларацииНаТовары = МассивТД[2];
	
	Если СтрДлина(ПорядковыйНомерДекларацииНаТовары) > 8
	 ИЛИ СтрДлина(ПорядковыйНомерДекларацииНаТовары) < 7 Тогда
		Возврат ПустойРегистрационныйНомер;
	КонецЕсли;
	
	// В устаревшем формате предварительной таможенной декларации (ориентировочно 2008 год)
	// порядковый номер декларации на товары состоит из 7 символов, первый символ - буква "П",
	// шесть оставшихся - цифры.
	// В случае представления заявления о выпуске товаров до подачи декларации на товары (ориентировочно с 4 августа 2019 года) 
	// регистрационный номер таможенной декларации имеет вид
	//    X......X/XXXXXX/BXXXXXX
	//   ________ ______ ________,
	// 
	//      1      2        3
	//(в ред. решения Коллегии Евразийской экономической комиссии от 02.07.2019 N 108)
	Если СтрДлина(ПорядковыйНомерДекларацииНаТовары) = 7 Тогда
		ПервыйСимвол = ВРег(Лев(ПорядковыйНомерДекларацииНаТовары, 1));
		ПоследниеШестьСимволов = ВРег(Прав(ПорядковыйНомерДекларацииНаТовары, 6));
		УстаревшийНомерТД = ПервыйСимвол = "П" И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПоследниеШестьСимволов);
		ЗаявлениеОВыпускеТоваров2019 = ПервыйСимвол = "В" И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПоследниеШестьСимволов);
		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПорядковыйНомерДекларацииНаТовары)
		   И НЕ УстаревшийНомерТД 
		   И НЕ ЗаявлениеОВыпускеТоваров2019 Тогда
			// Ошибочный формат поля порядковый номер.
			Возврат ПустойРегистрационныйНомер;
		КонецЕсли;
	КонецЕсли;
	
	// В случае выпуска товаров до подачи таможенной декларации импортер представляет в налоговый орган
	// обязательство о подаче таможенной декларации (до 2018 года) 
	// или заявление о выпуске товаров (с 1 января 2018 года по 4 августа 2019 года).
	// При этом порядковый номер декларации на товары состоит из 8 символов.
	// Порядковый принимает вид "ОБ123456" или "ЗВ123456" соответственно.
	Если СтрДлина(ПорядковыйНомерДекларацииНаТовары) = 8 Тогда
		ПервыеДваСимвола = ВРег(Лев(ПорядковыйНомерДекларацииНаТовары, 2));
		Если ПервыеДваСимвола <> "ОБ"
		   И ПервыеДваСимвола <> "OБ"
		   И ПервыеДваСимвола <> "ЗВ"
		   И ПервыеДваСимвола <> "ЗB" Тогда
			Возврат ПустойРегистрационныйНомер;
		КонецЕсли;
		ПоследниеШестьСимволов = ВРег(Прав(ПорядковыйНомерДекларацииНаТовары, 6));
		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПоследниеШестьСимволов) Тогда
			Возврат ПустойРегистрационныйНомер;
		КонецЕсли;
	КонецЕсли;
	
	Если МассивТД.Количество() = 4 Тогда
		ПорядковыйНомерТовара = МассивТД[3];
		Если СтрДлина(ПорядковыйНомерТовара) > 3
		 ИЛИ СтрДлина(ПорядковыйНомерТовара) < 1 Тогда
			Возврат ПустойРегистрационныйНомер;
		КонецЕсли;
		МассивТД.Удалить(3);
	КонецЕсли;
	
	Возврат СтрСоединить(МассивТД, "/");
	
КонецФункции

#КонецОбласти

#Область ИнтерфейсПечати

// Функция возвращает массив номеров ГТД, которые использовались для указаной номенклатуры
// Если номенклатура не указана. возращается пустой массив.
//
// Параметры:
//	УсловияОтбора - Структура	- Содержит поля отборов.
//	Описание:
// 	* Организация (Справочники.Организации) - если не заполнено, выборка происходит по всем организациям;
// 	* Номенклатура (Справочники.Номенклатура) - если не заполнено, возращается пустой массив;
// 	* Характеристика (Справочники.ХарактеристикиНоменклатуры) - если не заполнено, выбираем все характеристики;
// 	* Партия (Справочники.ПартииНоменклатуры) - если не заполнено, выбираем все партии;
// 	* СтранаПроисхожденния (Справочники.СтраныМира) - если не заполнено, выбираем по любой стране;
//
Функция ПолучитьМассивИспользуемыхНомеровГТД(УсловияОтбора) Экспорт
	
	Если НЕ (УсловияОтбора.Свойство("Номенклатура")
		И ЗначениеЗаполнено(УсловияОтбора.Номенклатура)) Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ РегистрГТД.НомерГТД КАК НомерГТД ИЗ РегистрНакопления.ЗапасыВРазрезеГТД КАК РегистрГТД ГДЕ 
	|&УсловиеОрганизации
	|И РегистрГТД.Номенклатура = &Номенклатура
	|И &УсловиеХарактеристики
	|И &УсловиеПартии
	|И &УсловиеСтраныПроисхождения");
	
	Запрос.УстановитьПараметр("Номенклатура", УсловияОтбора.Номенклатура);
		
	Если УсловияОтбора.Свойство("Организация")
		И ЗначениеЗаполнено(УсловияОтбора.Организация) Тогда
		
		Если ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями") 
			И УсловияОтбора.Свойство("ПоддержкаИнтеркампани")
			И УсловияОтбора.ПоддержкаИнтеркампани = Истина Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОрганизации", "РегистрГТД.Организация В (&Организации)");
			ОрганизацииОстатков = ИнтеркампаниСервер.ОрганизацииОстатков(
				Константы.УчетПоКомпании.Компания(УсловияОтбора.Организация));
			Запрос.УстановитьПараметр("Организации", ОрганизацииОстатков);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОрганизации", "РегистрГТД.Организация = &Организация");
			Запрос.УстановитьПараметр("Организация", Константы.УчетПоКомпании.Компания(УсловияОтбора.Организация));
		КонецЕсли; 
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОрганизации", "Истина");
		
	КонецЕсли;
		
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики")
		И УсловияОтбора.Свойство("Характеристика") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеХарактеристики", "РегистрГТД.Характеристика = &Характеристика");
		Запрос.УстановитьПараметр("Характеристика", УсловияОтбора.Характеристика);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеХарактеристики", "Истина");
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии")
		И УсловияОтбора.Свойство("Партия") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПартии", "РегистрГТД.Партия = &Партия");
		Запрос.УстановитьПараметр("Партия", УсловияОтбора.Партия);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПартии", "Истина");
		
	КонецЕсли;
		
	Если УсловияОтбора.Свойство("СтранаПроисхождения")
		И ЗначениеЗаполнено(УсловияОтбора.СтранаПроисхождения) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтраныПроисхождения", "РегистрГТД.СтранаПроисхождения = &СтранаПроисхождения");
		Запрос.УстановитьПараметр("СтранаПроисхождения", УсловияОтбора.СтранаПроисхождения);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтраныПроисхождения", "Истина");
		
	КонецЕсли;
	
	ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаРезультатаЗапроса.ВыгрузитьКолонку("НомерГТД");
	
КонецФункции // ПолучитьМассивИспользуемыхНомеровГТД()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
